Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# agent.model.error.toolCallingUnsupportedFormat
source: Model %@ does not support the tool calling required by Agent.
ar: الموديل %@ لا يدعم استدعاءات الأدوات المطلوبة من قبل الوكيل.
de: Modell %@ unterstützt keine Werkzeugaufrufe, die der Agent benötigt.
es: El modelo %@ no soporta las llamadas a herramientas requeridas por el Agente.
fr: Le modèle %@ ne supporte pas les appels d'outils requis par l'Agent.
id: Model %@ tidak mendukung panggilan alat yang dibutuhkan oleh Agent.
it: Modello %@ non supporta le chiamate strumento richieste dall'Agent.
ja: モデル %@ はエージェントが要求するツールコールに対応していません。
ko: %@ 모델은 Agent가 요구하는 도구 호출을 지원하지 않습니다.
nl: Model %@ ondersteunt geen gereedschapsoproepen zoals vereist door de Agent.
pl: Model %@ nie wspiera wywołań narzędzi wymaganych przez Agenta.
pt_br: Modelo %@ não suporta chamadas de ferramentas exigidas pelo Agente.
ru: Модель %@ не поддерживает вызов инструментов, необходимых Agent.
tr: Model %@ Agent tarafından gerektirilen araç çağrısını desteklemiyor.
uk: Модель %@ не підтримує виклик інструментів, необхідних для Ейджента.
vi: Mô hình %@ không hỗ trợ gọi công cụ yêu cầu của Agent.
zh_hans: 模型 %@ 不支持 Agent 所需的工具调用。
zh_hant: 模型 %@ 不支援 Agent 需要的工具呼叫功能。

# agent.persistence.error.runInterrupted
source: The previous Agent run was interrupted before it finished. You can retry it from this run.
ar: تمت مقاطعة تشغيل Agent السابق قبل اكتماله. يمكنك إعادة المحاولة من هذا التشغيل.
de: Der vorherige Agent-Lauf wurde vor Abschluss unterbrochen. Sie können ihn in diesem Lauf erneut versuchen.
es: La ejecución anterior del Agent se interrumpió antes de finalizar. Puedes reintentarla desde esta ejecución.
fr: L’exécution précédente de l’Agent a été interrompue avant la fin. Vous pouvez la relancer depuis cette exécution.
id: Proses Agent sebelumnya terhenti sebelum selesai. Anda dapat mencoba lagi dari proses ini.
it: L’esecuzione precedente dell’Agent è stata interrotta prima del completamento. Puoi riprovarla da questa esecuzione.
ja: 前回の Agent 実行は完了前に中断されました。この Run から再試行できます。
ko: 이전 Agent 실행이 완료되기 전에 중단되었습니다. 이 Run에서 다시 시도할 수 있습니다.
nl: De vorige Agent-run is onderbroken voordat deze was voltooid. U kunt deze vanuit deze run opnieuw proberen.
pl: Poprzednie uruchomienie Agenta zostało przerwane przed zakończeniem. Możesz ponowić je z tego uruchomienia.
pt_br: A execução anterior do Agent foi interrompida antes de terminar. Você pode tentar novamente a partir desta execução.
ru: Предыдущий запуск Agent был прерван до завершения. Его можно повторить из этого запуска.
tr: Önceki Agent çalışması tamamlanmadan kesildi. Bu çalışmadan yeniden deneyebilirsiniz.
uk: Попередній запуск Agent було перервано до завершення. Його можна повторити з цього запуску.
vi: Lần chạy Agent trước đã bị gián đoạn trước khi hoàn tất. Bạn có thể thử lại từ lần chạy này.
zh_hans: 上次 Agent 运行在完成前被中断，可在当前 Run 中重试。
zh_hant: 上次 Agent 執行在完成前被中斷，可在目前 Run 中重試。

# agent.persistence.error.invalidRecordFormat
source: Invalid Agent persistence record: %@.
ar: سجل تخزين الوكيل غير صالح: %@.
de: Ungültiger Agent-Persistenzdatensatz: %@.
es: Registro de persistencia del Agente inválido: %@.
fr: Enregistrement Agent de persistance invalide : %@.
id: Catatan persisten Agent tidak valid: %@.
it: Registrazione persistenza Agent invalida: %@.
ja: 無効なエージェント保存レコード: %@。
ko: 유효하지 않은 Agent 지속성 기록: %@.
nl: Ongeldig Agent-persistentie-register: %@.
pl: Nieprawidłowy rekord persystencji Agenta: %@.
pt_br: Registro de persistência do Agente inválido: %@.
ru: Некорректная запись сохранения Agent: %@.
tr: Geçersiz Agent sürdürülebilirlik kaydı: %@.
uk: Невідповідний запис персистентності Ейджента: %@
vi: Bản ghi lưu trữ Agent không hợp lệ: %@.
zh_hans: Agent 持久化记录无效：%@。
zh_hant: 無效的 Agent 持久化記錄：%@。

# agent.schema.error.missingRequiredFormat
source: Invalid tool input at %1$@: missing required property %2$@.
ar: مدخل أداة غير صالح في %1$@: نقص خاصية مطلوبة %2$@.
de: Ungültige Eingabe für das Werkzeug an %1$@: Fehlende Pflichtangabe %2$@.
es: Entrada de herramienta inválida en %1$@: propiedad requerida faltante %2$@.
fr: Entrée d'outil invalide à %1$@ : propriété requise manquante %2$@.
id: Masukkan alat tidak valid di %1$@: properti wajib %2$@ hilang.
it: Input dello strumento invalido a %1$@: proprietà obbligatoria mancante %2$@.
ja: %1$@ でのツール入力が不足（必須プロパティ %2$@）。
ko: %1$@에서 유효하지 않은 도구 입력: 필수 속성이 누락되었습니다 (%2$@).
nl: Ongeldige invoer voor gereedschap bij %1$@: ontbrekende verplichte eigenschap %2$@.
pl: Błędne wejście narzędzia w %1$@: brak wymaganego pola %2$@.
pt_br: Entrada da ferramenta inválida em %1$@: propriedade obrigatória %2$@ está faltando.
ru: Недопустимый ввод для инструмента на позиции %1$@: отсутствует обязательное свойство %2$@.
tr: Geçersiz araç girişi %1$@: zorunlu özelliği eksik %2$@.
uk: Недійсні дані інструменту на %1$@: відсутня обов'язкова властивість %2$@.
vi: Đầu vào công cụ không hợp lệ tại %1$@: thiếu thuộc tính bắt buộc %2$@.
zh_hans: 工具输入 %1$@ 无效：缺少必填字段 %2$@。
zh_hant: 工具輸入於 %1$@ 缺少必要屬性 %2$@。

# agent.schema.error.typeMismatchFormat
source: Invalid tool input at %1$@: expected %2$@.
ar: مدخل أداة غير صالح في %1$@: المتوقع %2$@.
de: Ungültige Eingabe für das Werkzeug an %1$@: Erwarteter Typ %2$@.
es: Entrada de herramienta inválida en %1$@: se esperaba %2$@.
fr: Entrée d'outil invalide à %1$@ : type attendu %2$@.
id: Masukkan alat tidak valid di %1$@: harap %2$@.
it: Input dello strumento invalido a %1$@: atteso %2$@.
ja: %1$@ でのツール入力が不正（期待型: %2$@）。
ko: %1$@에서 유효하지 않은 도구 입력: %2$@가 예상됩니다.
nl: Ongeldige invoer voor gereedschap bij %1$@: verwacht %2$@.
pl: Błędne wejście narzędzia w %1$@: oczekiwano %2$@.
pt_br: Entrada da ferramenta inválida em %1$@: esperado %2$@.
ru: Недопустимый ввод для инструмента на позиции %1$@: ожидается тип %2$@.
tr: Geçersiz araç girişi %1$@: beklenmeyen %2$@.
uk: Невідповідні дані інструменту на %1$@: очікується тип %2$@.
vi: Đầu vào công cụ không hợp lệ tại %1$@: kỳ vọng %2$@.
zh_hans: 工具输入 %1$@ 无效：应为 %2$@。
zh_hant: 工具輸入於 %1$@ 預期類型為 %2$@。

# agent.schema.error.unknownPropertyFormat
source: Invalid tool input at %1$@: unknown property %2$@.
ar: مدخل أداة غير صالح في %1$@: خاصية مجهولة %2$@.
de: Ungültige Eingabe für das Werkzeug an %1$@: Unbekannte Eigenschaft %2$@.
es: Entrada de herramienta inválida en %1$@: propiedad desconocida %2$@.
fr: Entrée d'outil invalide à %1$@ : propriété inconnue %2$@.
id: Masukkan alat tidak valid di %1$@: properti tidak dikenal %2$@.
it: Input dello strumento invalido a %1$@: proprietà sconosciuta %2$@.
ja: %1$@ での未知のプロパティ %2$@。
ko: %1$@에서 유효하지 않은 도구 입력: 알 수 없는 속성 %2$@.
nl: Ongeldige invoer voor gereedschap bij %1$@: onbekende eigenschap %2$@.
pl: Błędne wejście narzędzia w %1$@: nieznane pole %2$@.
pt_br: Entrada da ferramenta inválida em %1$@: propriedade desconhecida %2$@.
ru: Недопустимый ввод для инструмента на позиции %1$@: неизвестное свойство %2$@.
tr: Geçersiz araç girişi %1$@: bilinmeyen özelliği %2$@.
uk: Невідповідні дані інструменту на %1$@: невідома властивість %2$@.
vi: Đầu vào công cụ không hợp lệ tại %1$@: thuộc tính chưa biết %2$@.
zh_hans: 工具输入 %1$@ 无效：未知字段 %2$@。
zh_hant: 工具輸入於 %1$@ 有未知屬性 %2$@。

# agent.schema.error.valueNotAllowedFormat
source: Invalid tool input at %@: value is not allowed.
ar: مدخل أداة غير صالح في %@: القيمة غير مسموحة.
de: Ungültige Eingabe für das Werkzeug an %@: Wert nicht erlaubt.
es: Entrada de herramienta inválida en %@: valor no permitido.
fr: Entrée d'outil invalide à %@ : valeur non autorisée.
id: Masukkan alat tidak valid di %@: nilai tidak diperbolehkan.
it: Input dello strumento invalido a %@: valore non consentito.
ja: %@ の値は許可されていません。
ko: %@에서 입력 값이 허용되지 않습니다.
nl: Ongeldige invoer voor gereedschap bij %@: waarde is niet toegestaan.
pl: Błędne wejście narzędzia w %@: wartość nie jest dozwolona.
pt_br: Entrada da ferramenta inválida em %@: valor não permitido.
ru: Недопустимый ввод для инструмента на позиции %@: значение не допускается.
tr: Geçersiz araç girişi %@: izin verilmeyen değer.
uk: Невідповідні дані інструменту на %@: значення недопустиме.
vi: Đầu vào công cụ không hợp lệ tại %@: giá trị không được phép.
zh_hans: 工具输入 %@ 无效：值不在允许范围内。
zh_hant: 工具輸入於 %@ 的值不被允許。

# agent.session.error.durationLimitFormat
source: Agent run exceeded its %.0f second time limit.
ar: تجاوز الوكيل حد الوقت %.0f ثانية.
de: Agenten-Durchgang überschritt die %.0f-Sekunden-Zeitgrenze.
es: La ejecución del Agente superó el límite de %.0f segundos.
fr: Exécution de l'Agent a dépassé la limite de %.0f secondes.
id: Putaran Agent melebihi batas waktu %.0f detiknya.
it: Esecuzione Agent ha superato il limite di %.0f secondi.
ja: エージェント実行が %.0f 秒の時間制限を超えました。
ko: Agent 실행이 %.0f초 시간 제한을 초과했습니다.
nl: Agent-run overschreedt de %.0f seconden tijdslimiet.
pl: Obieganie Agenta przekroczyło limit czasu %.0f sekund.
pt_br: Execução do Agente excedeu o limite de %.0f segundos.
ru: Выполнение Agent превысило лимит времени %.0f секунд.
tr: Agent çalışması %.0f saniyelik zaman sınırını aştı.
uk: Виконання Ейджента перевищило ліміт часу у %.0f секунд.
vi: Chạy Agent đã vượt quá giới hạn thời gian %.0f giây.
zh_hans: Agent 运行超过 %.0f 秒时限。
zh_hant: Agent 執行超過 %.0f 秒時間限制。

# agent.session.error.invalidRunID
source: The Agent command belongs to a different run.
ar: الأمر ينتمي إلى تشغيل مختلف.
de: Der Agentenbefehl gehört zu einem anderen Durchgang.
es: El comando del Agente pertenece a una ejecución diferente.
fr: La commande Agent appartient à une session différente.
id: Perintah Agent berasal dari putaran yang berbeda.
it: Il comando dell'Agent appartiene a un'esecuzione diversa.
ja: このエージェントコマンドは別の実行に属します。
ko: Agent 명령은 다른 실행에 속합니다.
nl: De Agent-opdracht behoort tot een andere run.
pl: Komenda Agenta należy do innego obiegu.
pt_br: O comando do Agente pertence a uma execução diferente.
ru: Команда Agent принадлежит другому выполнению.
tr: Agent komutu farklı bir çalışmaya aittir.
uk: Команда Ейджента належить іншому виконанню.
vi: Lệnh của Agent thuộc một phiên chạy khác.
zh_hans: Agent 命令不属于当前运行。
zh_hant: 此 Agent 指令屬於不同的執行任務。

# agent.session.error.iterationLimitFormat
source: Agent reached the %d iteration limit.
ar: وصل الوكيل إلى حد %d تكرارًا.
de: Agent erreichte die %d-Iterationsgrenze.
es: El Agente alcanzó el límite de %d iteraciones.
fr: L'Agent a atteint la limite d'itérations %d.
id: Agent mencapai batas iterasi ke-%d.
it: Agent ha raggiunto il limite di %d iterazioni.
ja: エージェントは %d 回の反復制限に達しました。
ko: Agent는 %d번 반복 제한에 도달했습니다.
nl: Agent bereikte het %d iteratielimiet.
pl: Agent osiągnął limit iteracji %d.
pt_br: Agente atingiu o limite de %d iterações.
ru: Agent достиг предела %d итераций.
tr: Agent %d iterasyon sınırına ulaştı.
uk: Ейджент досяг межі %d ітерацій.
vi: Agent đã đạt giới hạn vòng lặp %d.
zh_hans: Agent 已达到 %d 轮迭代上限。
zh_hant: Agent 已達 %d 次迭代上限。

# agent.session.error.terminal
source: The Agent run has already ended.
ar: انتهى تشغيل الوكيل بالفعل.
de: Der Agenten-Durchgang ist bereits beendet.
es: La ejecución del Agente ya terminó.
fr: L'exécution de l'Agent est déjà terminée.
id: Putaran Agent telah selesai.
it: L'esecuzione Agent è già terminata.
ja: エージェント実行はすでに終了しています。
ko: Agent 실행이 이미 종료되었습니다.
nl: De Agent-run is al beëindigd.
pl: Obieganie Agenta już się zakończyło.
pt_br: A execução do Agente já terminou.
ru: Выполнение Agent уже завершено.
tr: Agent çalışması zaten tamamlandı.
uk: Виконання Ейджента вже завершено.
vi: Phiên chạy của Agent đã kết thúc.
zh_hans: Agent 运行已经结束。
zh_hant: Agent 執行已結束。

# agent.session.error.tokenLimitFormat
source: Agent reached the %d token limit.
ar: وصل الوكيل إلى حد %d كلمة.
de: Agent erreichte die %d-Token-Grenze.
es: El Agente alcanzó el límite de %d tokens.
fr: L'Agent a atteint la limite de %d jetons.
id: Agent mencapai batas token %d.
it: Agent ha raggiunto il limite di %d token.
ja: %d トークン制限に到達しました。
ko: Agent는 %d 토큰 제한에 도달했습니다.
nl: Agent bereikte het %d tokenlimiet.
pl: Agent osiągnął limit tokenów %d.
pt_br: Agente atingiu o limite de %d tokens.
ru: Agent достиг лимита в %d токенов.
tr: Agent %d token sınırına ulaştı.
uk: Ейджент досяг ліміту у %d токенів.
vi: Agent đã đạt giới hạn token %d.
zh_hans: Agent 已达到 %d token 上限。
zh_hant: Agent 已達 %d 個 token 上限。

# agent.session.error.toolCallLimitFormat
source: Agent reached the %d tool-call limit.
ar: وصل الوكيل إلى حد %d استدعاء أداة.
de: Agent erreichte die %d-Werkzeugaufruf-Grenze.
es: El Agente alcanzó el límite de %d llamadas a herramientas.
fr: L'Agent a atteint la limite d'appels d'outils : %d.
id: Agent mencapai batas panggilan alat %d.
it: Agent ha raggiunto il limite di %d chiamate strumento.
ja: %d 個のツールコール制限に到達しました。
ko: Agent는 %d 도구 호출 제한에 도달했습니다.
nl: Agent bereikte het %d gereedschapsoproep-limiet.
pl: Agent osiągnął limit wywołań narzędzi %d.
pt_br: Agente atingiu o limite de %d chamadas de ferramenta.
ru: Agent достиг лимита в %d вызовов инструментов.
tr: Agent %d araç çağrı sınırına ulaştı.
uk: Ейджент досяг межі %d викликів інструментів.
vi: Agent đã đạt giới hạn gọi công cụ %d.
zh_hans: Agent 已达到 %d 次工具调用上限。
zh_hant: Agent 已達 %d 次工具呼叫上限。

# agent.session.error.waitingForConfirmation
source: The Agent run is waiting for confirmation.
ar: شغل الوكيل في انتظار تأكيد.
de: Der Agenten-Durchgang wartet auf Bestätigung.
es: La ejecución del Agente está esperando confirmación.
fr: L'exécution de l'Agent attend une confirmation.
id: Putaran Agent menunggu konfirmasi.
it: L'esecuzione Agent attende conferma.
ja: エージェント実行は確認待ちです。
ko: Agent 실행이 확인을 기다립니다.
nl: De Agent-run wacht op bevestiging.
pl: Obieganie Agenta czeka na potwierdzenie.
pt_br: A execução do Agente está aguardando confirmação.
ru: Выполнение Agent ожидает подтверждения.
tr: Agent çalışması onayı bekliyor.
uk: Виконання Ейджента чекає підтвердження.
vi: Phiên chạy của Agent đang chờ xác nhận.
zh_hans: Agent 正在等待用户确认。
zh_hant: Agent 執行等待確認中。

# agent.tool.permission.highCost
source: High cost
ar: تكلفة عالية
de: Hohe Kosten
es: Alto costo
fr: Coût élevé
id: Biaya tinggi
it: Costo elevato
ja: 高コスト
ko: 비용이 높음
nl: Hoog kosten
pl: Wysoki koszt
pt_br: Custo alto
ru: Высокая стоимость
tr: Yüksek maliyet
uk: Висока вартість
vi: Chi phí cao
zh_hans: 高成本
zh_hant: 成本過高

# agent.tool.permission.readOnly
source: Read only
ar: قراءة فقط
de: Nur Lesen
es: Solo lectura
fr: Lecture seule
id: Hanya baca
it: Solo lettura
ja: 読み取り専用
ko: 읽기 전용
nl: Alleen lezen
pl: Tylko do odczytu
pt_br: Somente leitura
ru: Только для чтения
tr: Sadece okunur
uk: Тільки для читання
vi: Chỉ đọc
zh_hans: 只读
zh_hant: 僅讀取

# agent.tool.permission.requiresConfirmation
source: Requires confirmation
ar: يحتاج إلى تأكيد
de: Benötigt Bestätigung
es: Requiere confirmación
fr: Nécessite une confirmation
id: Memerlukan konfirmasi
it: Richiede conferma
ja: 確認が必要
ko: 확인이 필요함
nl: Vereist bevestiging
pl: Wymaga potwierdzenia
pt_br: Requer confirmação
ru: Требуется подтверждение
tr: Onay gerektirir
uk: Потрібно підтвердження
vi: Cần xác nhận
zh_hans: 需要确认
zh_hant: 需確認

# agent.tool.registry.duplicateNameFormat
source: Duplicate Agent tool name: %@.
ar: اسم أداة تكراري: %@.
de: Duplizierter Agent-Werkzeugname: %@.
es: Nombre duplicado de herramienta del Agente: %@.
fr: Nom d'outil Agent dupliqué : %@.
id: Nama alat Agent duplikasi: %@.
it: Nome strumento Agent duplicato: %@.
ja: 重複するエージェント・ツール名: %@。
ko: 중복된 Agent 도구 이름: %@.
nl: Dubbele naam voor Agent-gereedschap: %@.
pl: Powtórzona nazwa narzędzia Agenta: %@.
pt_br: Nome de ferramenta do Agente duplicado: %@.
ru: Повторное имя инструмента Agent: %@.
tr: Tekrar eden Agent araç adı: %@.
uk: Дублюється назва інструменту Ейджента: %@.
vi: Tên công cụ Agent trùng lặp: %@.
zh_hans: Agent 工具名称重复：%@。
zh_hant: 重複的 Agent 工具名稱：%@。

# agent.tool.registry.invalidInputFormat
source: Invalid input for Agent tool %1$@: %2$@
ar: مدخل غير صالح لأداة الوكيل %1$@: %2$@
de: Ungültige Eingabe für das Agentenwerkzeug %1$@: %2$@
es: Entrada inválida para la herramienta del Agente %1$@: %2$@
fr: Entrée invalide pour l'outil Agent %1$@ : %2$@
id: Masukkan tidak valid untuk alat Agent %1$@: %2$@
it: Input invalido per lo strumento Agent %1$@: %2$@
ja: エージェント・ツール %1$@ の入力が無効です: %2$@
ko: %1$@의 유효하지 않은 입력 (Agent 도구): %2$@
nl: Ongeldige invoer voor Agent-gereedschap %1$@: %2$@
pl: Nieprawidłowe wejście dla narzędzia Agenta %1$@: %2$@
pt_br: Entrada inválida para a ferramenta do Agente %1$@: %2$@
ru: Некорректный ввод для инструмента Agent %1$@: %2$@
tr: Agent araç için geçersiz giriş %1$@: %2$@
uk: Невідповідний ввід для інструменту Ейджента %1$@: %2$@
vi: Đầu vào không hợp lệ cho công cụ Agent %1$@: %2$@
zh_hans: Agent 工具 %1$@ 的输入无效：%2$@
zh_hant: Agent 工具 %1$@ 的輸入無效：%2$@。

# agent.tool.registry.invalidNameFormat
source: Invalid Agent tool name: %@.
ar: اسم أداة الوكيل غير صالح: %@.
de: Ungültiger Agent-Werkzeugname: %@.
es: Nombre inválido de herramienta del Agente: %@.
fr: Nom d'outil Agent invalide : %@.
id: Nama alat Agent tidak valid: %@.
it: Nome strumento Agent invalido: %@.
ja: 無効なエージェント・ツール名: %@。
ko: 유효하지 않은 Agent 도구 이름: %@.
nl: Ongeldige naam voor Agent-gereedschap: %@.
pl: Nieprawidłowa nazwa narzędzia Agenta: %@.
pt_br: Nome da ferramenta do Agente inválido: %@.
ru: Некорректное имя инструмента Agent: %@.
tr: Geçersiz Agent araç adı: %@.
uk: Невідповідна назва інструменту Ейджента: %@.
vi: Tên công cụ Agent không hợp lệ: %@.
zh_hans: Agent 工具名称无效：%@。
zh_hant: 無效的 Agent 工具名稱：%@。

# agent.tool.registry.missingToolFormat
source: Missing Agent tool: %@.
ar: أداة الوكيل مفقودة: %@.
de: Fehlendes Agentenwerkzeug: %@.
es: Herramienta del Agente faltante: %@.
fr: Outil Agent manquant : %@.
id: Alat Agent hilang: %@.
it: Strumento Agent mancante: %@.
ja: 欠落するエージェント・ツール: %@。
ko: 누락된 Agent 도구: %@.
nl: Agent-gereedschap ontbreekt: %@.
pl: Brak narzędzia Agenta: %@.
pt_br: Ferramenta do Agente faltando: %@.
ru: Отсутствует инструмент Agent: %@.
tr: Eksik Agent araç: %@.
uk: Відсутній інструмент Ейджента: %@.
vi: Thiếu công cụ Agent: %@.
zh_hans: 缺少 Agent 工具：%@。
zh_hant: 缺少 Agent 工具：%@。

# agent.tool.status.completed
source: Completed
ar: مكتمل
de: Abgeschlossen
es: Completado
fr: Terminé
id: Selesai
it: Completato
ja: 完了
ko: 완료됨
nl: Voltooid
pl: Zakończono
pt_br: Concluído
ru: Завершено
tr: Tamamlandı
uk: Завершено
vi: Hoàn thành
zh_hans: 已完成
zh_hant: 完成

# agent.tool.status.failed
source: Failed
ar: فشل
de: Fehlerhaft
es: Fallido
fr: Échec
id: Gagal
it: Fallito
ja: 失敗
ko: 실패
nl: Gefaald
pl: Nieudane
pt_br: Falhou
ru: Неудачно
tr: Başarısız
uk: Помилка
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# agent.tool.status.pending
source: Pending
ar: في الانتظار
de: Ausstehend
es: Pendiente
fr: En attente
id: Menunggu
it: In attesa
ja: 待機中
ko: 대기 중
nl: Wachtend
pl: Oczekiwanie
pt_br: Pendente
ru: В ожидании
tr: Bekleyen
uk: Очікування
vi: Đang chờ
zh_hans: 等待执行
zh_hant: 待處理

# agent.tool.status.rejected
source: Rejected
ar: رفض
de: Abgelehnt
es: Rechazado
fr: Rejeté
id: Ditolak
it: Rifiutato
ja: 拒否
ko: 거부됨
nl: Afgewezen
pl: Odrzucone
pt_br: Rejeitado
ru: Отклонено
tr: Reddedildi
uk: Відхилено
vi: Từ chối
zh_hans: 已拒绝
zh_hant: 被拒絕

# agent.tool.status.skipped
source: Skipped
ar: تخطي
de: Übersprungen
es: Omitido
fr: Ignoré
id: Dilewati
it: Saltato
ja: スキップ
ko: 건너뜀
nl: Overgeslagen
pl: Pominięto
pt_br: Pulado
ru: Пропущено
tr: Atlandı
uk: Пропущено
vi: Bỏ qua
zh_hans: 已跳过
zh_hant: 跳過

# agent.tool.status.timedOut
source: Timed out
ar: تجاوز الوقت
de: Zeit abgelaufen
es: Expiró el tiempo de espera
fr: Dépassé le délai
id: Melewati batas waktu
it: Scaduto
ja: タイムアウト
ko: 타임아웃
nl: Getime-out
pl: Wygasło
pt_br: Expirou o tempo limite
ru: Истекло время
tr: Zaman aşımına uğradı
uk: Час вичерпано
vi: Hết thời gian chờ
zh_hans: 已超时
zh_hant: 超時

# agent.workspace.attachment.fileTooLargeFormat
source: %1$@ exceeds the %2$d KB per-file limit.
ar: %1$@ يتجاوز الحد المسموح به من %2$d كيلوبايت لكل ملف.
de: %1$@ überschreitet die %2$d KB-Grenze pro Datei.
es: %1$@ supera el límite de %2$d KB por archivo.
fr: %1$@ dépasse la limite de %2$d Ko par fichier.
id: %1$@ melebihi batas ukuran %2$d KB per-file.
it: %1$@ supera il limite di %2$d KB per file.
ja: %1$@ は %2$d KB のファイルあたりの上限を超えています。
ko: %1$@는 %2$d KB의 파일당 한도를 초과했습니다.
nl: %1$@ overschrijdt de %2$d KB per-bestandlimiet.
pl: %1$@ przekracza limit %2$d KB na jeden plik.
pt_br: %1$@ excede o limite de %2$d KB por arquivo.
ru: %1$@ превышает лимит %2$d КБ на файл.
tr: %1$@ dosya boyutu %2$d KB'lık tek dosya sınırını aştı.
uk: %1$@ перевищує ліміт %2$d КБ на файл.
vi: %1$@ vượt quá giới hạn %2$d KB cho mỗi file.
zh_hans: %1$@ 超过单文件 %2$d KB 限制。
zh_hant: %1$@ 超過每檔案 %2$d KB 的限制。

# agent.workspace.attachment.help
source: Attach text files
ar: إرفاق ملفات نصية
de: Textdateien anhängen
es: Adjuntar archivos de texto
fr: Joindre des fichiers texte
id: Lampirkan file teks
it: Aggiungi file di testo
ja: テキストファイルを添付する
ko: 텍스트 파일을 첨부하세요
nl: Tekstbestanden bijvoegen
pl: Dodaj pliki tekstowe
pt_br: Anexar arquivos de texto
ru: Прикрепить текстовые файлы
tr: Metin dosyaları ekleyin
uk: Додати текстовий файл
vi: Đính kèm tệp văn bản
zh_hans: 添加文本附件
zh_hant: 附加文字檔案

# agent.workspace.attachment.notUTF8Format
source: %@ is not a UTF-8 text file.
ar: %@ ليس ملف نصي UTF-8.
de: %@ ist keine UTF-8-Textdatei.
es: %@ no es un archivo de texto UTF-8.
fr: %@ n'est pas un fichier texte UTF-8.
id: %@ bukan berformat file teks UTF-8.
it: %@ non è un file di testo UTF-8.
ja: %@ は UTF-8 テキストファイルではありません。
ko: %@는 유니코드 UTF-8 텍스트 파일이 아닙니다.
nl: %@ is geen UTF-8 tekstbestand.
pl: Plik %@ nie jest poprawnym plikiem UTF-8.
pt_br: %@ não é um arquivo de texto UTF-8.
ru: %@ не является UTF-8 текстовым файлом.
tr: %@ bir UTF-8 metin dosyası değil.
uk: %@ не є файлом UTF-8.
vi: %@ không phải là một tệp văn bản UTF-8.
zh_hans: %@ 不是 UTF-8 文本文件。
zh_hant: %@ 不是 UTF-8 格式的文字檔案。

# agent.workspace.attachment.panelTitle
source: Attach Text Files
ar: إرفاق ملفات نصية
de: Textdateien anhängen
es: Adjuntar Archivos de Texto
fr: Joindre des Fichiers Textes
id: Lampirkan File Teks
it: Aggiungi File Testo
ja: テキストファイルの添付
ko: 텍스트 파일 첨부
nl: Tekstbestanden Bijvoegen
pl: Dodaj Pliki Tekstowe
pt_br: Anexar Arquivos de Texto
ru: Прикрепить Текстовые Файлы
tr: Metin Dosyalarını Ekle
uk: Додавання Текстових Файлів
vi: Đính Kèm Tệp Văn Bản
zh_hans: 添加文本附件
zh_hant: 附加文字檔案

# agent.workspace.attachment.readFailedFormat
source: Could not read %1$@: %2$@
ar: لم يتم قراءة %1$@: %2$@
de: Konnte %1$@ nicht lesen: %2$@
es: No se pudo leer %1$@: %2$@
fr: Impossible de lire %1$@ : %2$@
id: Gagal membaca %1$@: %2$@
it: Impossibile leggere %1$@: %2$@
ja: %1$@ を読み込めませんでした: %2$@
ko: %1$@를 읽을 수 없습니다: %2$@
nl: Kon %1$@ niet lezen: %2$@
pl: Nie udało się odczytać %1$@: %2$@
pt_br: Não foi possível ler %1$@: %2$@
ru: Не удалось прочитать %1$@: %2$@
tr: %1$@ okunamadı: %2$@
uk: Не вдалося прочитати %1$@: %2$@
vi: Không thể đọc %1$@: %2$@
zh_hans: 无法读取 %1$@：%2$@
zh_hant: 無法讀取 %1$@：%2$@

# agent.workspace.attachment.remove
source: Remove attachment
ar: إزالة الإرفاق
de: Anhang entfernen
es: Eliminar adjunto
fr: Supprimer la pièce jointe
id: Hapus lampiran
it: Rimuovi allegato
ja: 添付を削除する
ko: 첨부 취소
nl: Bijvoegsel verwijderen
pl: Usuń załącznik
pt_br: Remover anexo
ru: Удалить прикрепление
tr: Eklemeyi kaldır
uk: Видалити додаток
vi: Xóa đính kèm
zh_hans: 移除附件
zh_hant: 移除附件
